---
kind: method
id: M:Autodesk.Revit.DB.ColumnAttachment.Dispose
source: html/17052fbb-c1be-6a0e-229b-7317b22cdb2b.htm
---
# Autodesk.Revit.DB.ColumnAttachment.Dispose Method

Releases all resources used by the ColumnAttachment

## Syntax (C#)
```csharp
public void Dispose()
```